IDEA StatiCa Open Model
TimePoint.Fix2DRotation Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 true to fix around Y axis ( Mz is not taken into account )
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool Fix2DRotation { get; set; }
Public Property Fix2DRotation As Boolean
	Get
	Set
public:
property bool Fix2DRotation {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
TimePoint Class
IdeaRS.OpenModel.Concrete Namespace